/*
 *  familyf_msr.h 
 *
 *  Copyright (C) 2002-2004 Intel Corporation 
 *  Maintainer - Juan Villacis <juan.villacis@intel.com>
 *
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 *
 *  This program is free software; you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation; either version 2 of the License, or
 *  (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License
 *  along with this program; if not, write to the Free Software
 *  Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA
 *
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 */
/*
 * ===========================================================================
 *
 *	File: familyf_msr.h 
 *
 *	Description: Definition file for Intel(R) Pentium(R) 4 processor
 *                   performance event counters.
 *                   The presence of the Debug Trace and precise EMON features
 *                   can be determined via the DTS bit (bit 21) in the feature
 *                   flags returned by the CPUID instruction. 
 *

    +------------+----------------------------------------------------------------+
    |   0x0C     | DTS interrupt threshold. Must be < absolute maximum.           |
    |            |   Must be at an offset from the base that is a multiple of     |
    |            |   the branch trace message record size                         |
    +------------+----------------------------------------------------------------+
    |   0x10     | precise event-based sampling buffer base                       |
    +------------+----------------------------------------------------------------+
    |   0x14     | precise event-based sampling index                             |
    +------------+----------------------------------------------------------------+
    |   0x18     | precise event-based sampling absolute max                      |
    +------------+----------------------------------------------------------------+ 
    |   0x1C     | precise event-based sampling interrupt threshold.              |
    |            |   Must be < absolute maximum. Must be at an offset from        |
    |            |   the base that is a multiple of the branch trace message      |
    |            |   record size.                                                 |
    +------------+----------------------------------------------------------------+
    |   0x20     | precise event-based sampling counter reset value, lower 32 bits|
    +------------+----------------------------------------------------------------+
    |   0x24     | precise event-based sampling counter reset value, upper 8-bits |
    +------------+----------------------------------------------------------------+
    |   0x30     | Reserved - 128 bytes                                           |
    +------------+----------------------------------------------------------------+

    Each precise Event-based Sampling Record:
    
    +------------+----------------------------+
    |  Offset    | Contents                   |
    +------------+----------------------------+
    |   0x00     | Eflags                     |
    +------------+----------------------------+
    |   0x04     | Linear IP                  |
    +------------+----------------------------+
    |   0x08     | EAX                        |
    +------------+----------------------------+
    |   0x0C     | EBX                        |
    +------------+----------------------------+
    |   0x10     | ECX                        |
    +------------+----------------------------+
    |   0x14     | EDX                        |
    +------------+----------------------------+
    |   0x18     | ESI                        |
    +------------+----------------------------+ 
    |   0x1C     | EDI                        |
    +------------+----------------------------+
    |   0x20     | EBP                        |
    +------------+----------------------------+
    |   0x24     | ESP                        |
    +------------+----------------------------+

*/

typedef struct _DTS_RECORD {
    void_ptr from_address;
    void_ptr to_address;
    void_ptr branch_prediction; // Only for Pentium(R) 4 processor
} DTS_RECORD, *PDTS_RECORD;

typedef struct _DTS_BUFFER {
    __u32 base;
    __u32 index;
    __u32 max;
    __u32 threshold;
    __u32 PEBS_base;
    __u32 PEBS_index;
    __u32 PEBS_max;
    __u32 PEBS_threshold;
    __u32 PEBS_counter_reset_value1;    //lower 32 bits
    __u32 PEBS_counter_reset_value2;    //Upper 8 bits
    __u32 buffer[32];   // 128 bytes Pentium(R) 4 processor OSWG Manual
} DTS_BUFFER, *PDTS_BUFFER;

typedef enum _buffer_mode {
    buf_circular,
    buf_interrupt
} buffer_mode;

typedef struct _DTS_USER_HEADER {
    char processor_number;
    __u32 number_of_branches;
    __u32 buffer_mode;  // buf_circular, buf_interrupt or Emon
    __u32 reserved1;
} DTS_USER_HEADER, *PDTS_USER_HEADER;

#define DTS_RECORD_SIZE             sizeof(DTS_RECORD)
#define DTS_SAVE_AREA               sizeof(DTS_BUFFER)

#define OVERFLOW_RECORDS_SIZE       (OVERFLOW_RECORDS*DTS_RECORD_SIZE)
#define DTS_INFO_AREA               (DTS_SAVE_AREA+OVERFLOW_RECORDS_SIZE+DTS_RECORD_SIZE)
#define DEFAULT_BUFFER_SIZE         (MINIMUM_BRANCHES*DTS_RECORD_SIZE+DTS_INFO_AREA)

/*
    __u32 linear_IP;
*/

//
// For PEBS
//
typedef struct _PEBS_RECORD {
    __u32 E_flags;
    __u32 linear_IP;
    __u32 EAX1;
    __u32 EBX1;
    __u32 ECX1;
    __u32 EDX1;
    __u32 ESI1;
    __u32 EDI1;
    __u32 EBP1;
    __u32 ESP1;
} PEBS_RECORD, *PPEBS_RECORD;

typedef struct _PEBS_USER_HEADER {
    char processor_number;
    __u32 number_of_samples;
    __u32 buffer_mode;
    __u32 reserved1;
} PEBS_USER_HEADER, *PPEBS_USER_HEADER;

#define PEBS_RECORD_SIZE            sizeof(PEBS_RECORD)
#define PEBS_INFO_AREA              (DTS_SAVE_AREA+PEBS_OVERFLOW_SIZE+PEBS_RECORD_SIZE)

//
// Where the LBRs are... at least for now...
// no guarantee they will remain here or remain sequentially ordered...
//
#define MSR_LASTBRANCH_TOS  	0x01da
#define MSR_LASTBRANCH_0    	(MSR_LASTBRANCH_TOS + 1)
#define MSR_LASTBRANCH_1    	(MSR_LASTBRANCH_0 + 1)
#define MSR_LASTBRANCH_2    	(MSR_LASTBRANCH_0 + 2)
#define MSR_LASTBRANCH_3    	(MSR_LASTBRANCH_0 + 3)

#define LBR_SAVE_SIZE		(sizeof(ULARGE_INTEGER) * 5)

typedef struct _IA32EM64T_DTS_BUFFER {
    __u64 base;                   // Offset 0x00
    __u64 index;                  // Offset 0x08
    __u64 max;                    // Offset 0x10
    __u64 threshold;              // Offset 0x18
    __u64 PEBS_base;               // Offset 0x20
    __u64 PEBS_index;              // Offset 0x28
    __u64 PEBS_max;                // Offset 0x30
    __u64 PEBS_threshold;          // Offset 0x38
    __u64 PEBS_counter_addr;        // Offset 0x40
    __u64 PEBS_counter_reset;       // Offset 0x48
} IA32EM64T_DTS_BUFFER, *PIA32EM64T_DTS_BUFFER;


//
// For PEBS
//
typedef struct _IA32EM64T_PEBS_RECORD {
    __u64 E_flags;            // Offset 0x00
    __u64 linear_IP;          // Offset 0x08
    __u64 rax;                // Offset 0x10
    __u64 rbx;                // Offset 0x18
    __u64 rcx;                // Offset 0x20
    __u64 rdx;                // Offset 0x28
    __u64 rsi;                // Offset 0x30
    __u64 rdi;                // Offset 0x38
    __u64 rbp;                // Offset 0x40
    __u64 rsp;                // Offset 0x48
    __u64 r8;                 // Offset 0x50
    __u64 r9;                 // Offset 0x58
    __u64 r10;                // Offset 0x60
    __u64 r11;                // Offset 0x68
    __u64 r12;                // Offset 0x70
    __u64 r13;                // Offset 0x78
    __u64 r14;                // Offset 0x80
    __u64 r15;                // Offset 0x88
} IA32EM64T_PEBS_RECORD, *PIA32EM64T_PEBS_RECORD;

//
// This is the same for all PEBS enabled processoes (so far) and would
// go in a "generic x86" PMU header file...
//
#define MSR_CR_DTES_AREA        0x600

//
// this is also common with all PEBS enabled processors (so far)
//
#define DEBUG_CTRL_TR_BIT   (1 << 2)

//
// Will need to move this to a processor specific spot... Since we need
// to deal with Intel(R) Pentium(R) 4 processors with Streaming SIMD 
// Extensions 3 (SSE3) vs. those without at runtime, we need this
// information in an array that is generated as needed.  So, use base
// base and counts instead of the full list spelled out.
//
// LBR msr's for IA-32 processors.  NOT ARCHITECTURAL so they can change!
//
#define MSR_LBR_PSC_TOS             474

#define MSR_LBR_PSC_SRC_BASE        1664
#define MSR_LBR_PSC_SRC_NUMBER      16

#define MSR_LBR_PSC_TARG_BASE       1728
#define MSR_LBR_PSC_TARG_NUMBER     16

